Revit 2025 API
BuiltInFailures.RebarFailures.Inverted3dShape Property
 The Rebar Shape XX cannot be inverted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public static FailureDefinitionId Inverted3dShape { get; }
Public Shared ReadOnly Property Inverted3dShape As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ Inverted3dShape {
	FailureDefinitionId^ get ();
}
static member Inverted3dShape : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace